Courses/4420/Lectures/Hardening/SysCalls/lab-virtual-box-setup.org
# -*- mode: org -*-
#+DATE: 2014-12-21
#+TITLE: Lab: Virtual Box Setup TBD
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:1
#+HTML_LINK_HOME: ./index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P {text-align: justify} code {font-family: monospace; font-size: 10pt;color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "%d "))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2014 &bull; <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything

VirtualBox FOSS software gives a virtual PC hardware, with virtual
HDD, KBD, etc devices.  We can install OS images and boot these OSs.
Installing and testing kernels that you modified and built is easier
to do first on the VB, and then move the kernels to the real hardware.
The main benefit is that if your kernel crashes, the real PC does not
crash, just the VirtualBox VM.

* Setting Up VirtualBox

** VirtualBox environment

One of you or your partner:



1.  ssh into the CS machine to which you have been assigned using your
shared account (ex. ginger and cs45X),  and choose a password for your
shared  account together so that both of you can remember it: 
#+begin_src bash  
    % ssh -X cs45X@ginger
#+end_src  
1.  Make a working_dir directory in <code>/local</code> that you and your 
partner will share.
For example, if my working_dir is named tia_n_pal:
#+begin_src bash  
    % mkdir /local/tia_n_pal 
    % chmod 700 /local/tia_n_pal
#+end_src  


1.  Copy over the virtualbox image files from /local/vm 
(a copy is also available on every CS in /scratch/vm, but it 
will take longer to copy over than the one in /local) 
into your <code>/local/working_dir</code> subdirectory:  
#+begin_src bash
    % cp -r /scratch/vm/ubuntu-12.04.3-NOINITRD  /local/tia_n_pal/. 
#+end_src


1.  Now you are ready to run virtualbox.





<div class="TagLine" id="starting"> 
* Running VirtualBox

<h4>Starting VirtualBox:</h4>

1. Log into the PC on which your virtualbox machine is located
using your shared account (ex: ginger, cs45X):  
#+begin_src bash
    % ssh -X cs45X@ginger 
#+end_src


1. Start virtualbox:
#+begin_src bash
    $ cd /local/you_n_partner/
    $ virtualbox 
    (ignore the "Error opening file for reading: Permission denied" error)
#+end_src
1.  The very first time you run virtualbox, you need to explicitly add
the VM image you want to run.  To do this:
<ul>
From the <tt>Machine</tt> menu choose <tt>Add</tt> then browse 
     through the files systems to select this file to open: 
#+begin_src bash
/local/you_n_partner/ubuntu-12.04.3-NOINITRD/ubuntu-12.04.3-NOINITRD.vbox 
#+end_src
</ul>


1.  In the VM Mananger window, select the VM you want to run (there is only
one choice) and then choose the start icon to start it running.


The starting point .vbox VM contains a single linux kernel to boot.  As you
add more kernels, you can select the particular kernel you want to boot
from the grub menu using the arrow keys and <tt>Enter</tt>.



<h4>running VirtualBox in non-gui mode</h4>
You can also run virtualbox in non-graphics mode.
This is useful when remotely connecting from outside of the cs subnet,
or when you want to start up virtualbox once, and then remotely log in 
over a period of time.  In the later case, you will need to run 
virtualbox within 
a <a href="http://www.cs.swarthmore.edu/help/long.html">screen</a> 
session as well as in non-graphics mode.  Here are the steps:
#+begin_src bash
$ screen    # start a screen session
$ vboxheadless -s "ubuntu-12.04.3-NOINITRD"  # run virtualbox in non-gui mode

Cntrl-a d          # detach from the screen session (machine keeps running)
#+end_src
note: this will always boot the default kernel (specified in the grub menu)
(and it takes about 1 minute to boot).  If the default kernel is not the
one you want to boot, you can change the default kernel:
#+begin_src bash
(1) in /etc/default/grub, set GRUB_DEFAULT to the number kernel entry you want:
    GRUB_DEFAULT=0    # the default kernel is the one in entry 0
                      # change it to be the entry you want as the default (0,1,2,...)

   you can list the kernels in which entry:
    grep menuentry /boot/grub/grub.cfg

(2) then run:
    sudo update-grub
#+end_src



<h4>Starting an OS inside of VirtualBox:</h4>

When virtualbox is run in gui mode, and you first boot up the system, 
you will see the grub menu with a list of kernels to boot.  Use the arrow 
keys to scroll through the list and then hit the Enter key to choose your 
kernel.  If you don't select one, after 10 seconds the default kernel 
(at the top of the list) is booted.  If you run in non-gui mode, the
default kernel boots.


After the kernel boots in your VM you can log into the console window.  
However, it will be easier to work on your virtual machine by ssh'ing into it.
To do this specify port number 10022 and the CSmachine on which you are 
running virtualbox.  There is one user account (swatcs) with the starting 
point VM, its password (swatcs.45):
#+begin_src bash
ssh -p 10022 swatcs@ginger   
#+end_src


The virtualbox image is set up with a single user account:
<code>swatcs</code>.  The password is <code>swatcs.45</code>.
You can change any of your user account passwords, by running the 
<code>passwd</code> command.  You can also add new users to the system 
using the <code>adduser</code> command.

<h4>Shutting down or rebooting an OS:</h4>

To shut down your kernel:
#+begin_src bash
$ sudo sync
$ sudo sync
$ sudo halt -p     # halt and power down
#+end_src

To reboot your kernel:
#+begin_src bash
$ sudo sync
$ sudo sync
$ sudo reboot
#+end_src



<h4>Shutting down VirtualBox:</h4>

First shut down your kernel, then exit virtualbox using the menu options.
If you run in non-gui mode, use CNTRL-C to exit vboxheadless after halting
your kernel.

<div class="TagLine" id="building"> 
