Courses/4420/Lectures/Hardening/SysCalls/lab-virtual-box-setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lab: Virtual Box Setup</title>
<!-- 2014-12-21 Sun 16:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="preamble" class="status">
2014-12-21 
</div>
<div id="content">
<h1 class="title">Lab: Virtual Box Setup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Setting Up VirtualBox</a></li>
<li><a href="#sec-2">2. Running VirtualBox</a></li>
<li><a href="#sec-3">3. Compiling, Installing and Booting your Kernel changes in VirtualBox</a></li>
<li><a href="#sec-4">4. ssh'ing and scp'ing from the host PC to your VM</a></li>
<li><a href="#sec-5">5. Debugging the Kernel</a></li>
<li><a href="#sec-6">6. Troubleshooting VirtualBox and Linux</a></li>
<li><a href="#sec-7">7. References</a></li>
</ul>
</div>
</div>
<p>
VirtualBox FOSS software gives a virtual PC hardware, with virtual
HDD, KBD, etc devices.  We can install OS images and boot these OSs.
Installing and testing kernels that you modified and built is easier
to do first on the VB, and then move the kernels to the real hardware.
The main benefit is that if your kernel crashes, the real PC does not
crash, just the VirtualBox VM.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Setting Up VirtualBox</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> VirtualBox environment</h3>
<div class="outline-text-3" id="text-1-1">
<p>
One of you or your partner:
</p>



<ol class="org-ol">
<li>ssh into the CS machine to which you have been assigned using your
</li>
</ol>
<p>
shared account (ex. ginger and cs45X),  and choose a password for your
shared  account together so that both of you can remember it: 
</p>
<div class="org-src-container">

<pre class="src src-bash">% ssh -X cs45X@ginger
</pre>
</div>
<ol class="org-ol">
<li>Make a working<sub>dir</sub> directory in &lt;code&gt;/local&lt;/code&gt; that you and your 
</li>
</ol>
<p>
partner will share.
For example, if my working<sub>dir</sub> is named tia<sub>n</sub><sub>pal</sub>:
</p>
<div class="org-src-container">

<pre class="src src-bash">% mkdir /local/tia_n_pal 
% chmod 700 /local/tia_n_pal
</pre>
</div>


<ol class="org-ol">
<li>Copy over the virtualbox image files from /local/vm 
</li>
</ol>
<p>
(a copy is also available on every CS in /scratch/vm, but it 
will take longer to copy over than the one in /local) 
into your &lt;code&gt;/local/working<sub>dir</sub>&lt;/code&gt; subdirectory:  
</p>
<div class="org-src-container">

<pre class="src src-bash">% cp -r /scratch/vm/ubuntu-12.04.3-NOINITRD  /local/tia_n_pal/.
</pre>
</div>


<ol class="org-ol">
<li>Now you are ready to run virtualbox.
</li>
</ol>





<p>
&lt;div class="TagLine" id="starting"&gt; 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Running VirtualBox</h2>
<div class="outline-text-2" id="text-2">
<p>
&lt;h4&gt;Starting VirtualBox:&lt;/h4&gt;
</p>

<ol class="org-ol">
<li>Log into the PC on which your virtualbox machine is located
</li>
</ol>
<p>
using your shared account (ex: ginger, cs45X):  
</p>
<div class="org-src-container">

<pre class="src src-bash">% ssh -X cs45X@ginger
</pre>
</div>


<ol class="org-ol">
<li>Start virtualbox:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-bash">$ cd /local/you_n_partner/
$ virtualbox 
(ignore the "Error opening file for reading: Permission denied" error)
</pre>
</div>
<ol class="org-ol">
<li>The very first time you run virtualbox, you need to explicitly add
</li>
</ol>
<p>
the VM image you want to run.  To do this:
&lt;ul&gt;
From the &lt;tt&gt;Machine&lt;/tt&gt; menu choose &lt;tt&gt;Add&lt;/tt&gt; then browse 
     through the files systems to select this file to open: 
</p>
<div class="org-src-container">

<pre class="src src-bash">/local/you_n_partner/ubuntu-12.04.3-NOINITRD/ubuntu-12.04.3-NOINITRD.vbox
</pre>
</div>
<p>
&lt;/ul&gt;
</p>


<ol class="org-ol">
<li>In the VM Mananger window, select the VM you want to run (there is only
</li>
</ol>
<p>
one choice) and then choose the start icon to start it running.
</p>


<p>
The starting point .vbox VM contains a single linux kernel to boot.  As you
add more kernels, you can select the particular kernel you want to boot
from the grub menu using the arrow keys and &lt;tt&gt;Enter&lt;/tt&gt;.
</p>



<p>
&lt;h4&gt;running VirtualBox in non-gui mode&lt;/h4&gt;
You can also run virtualbox in non-graphics mode.
This is useful when remotely connecting from outside of the cs subnet,
or when you want to start up virtualbox once, and then remotely log in 
over a period of time.  In the later case, you will need to run 
virtualbox within 
a &lt;a href="<a href="http://www.cs.swarthmore.edu/help/long.html">http://www.cs.swarthmore.edu/help/long.html</a>"&gt;screen&lt;/a&gt; 
session as well as in non-graphics mode.  Here are the steps:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ screen    # start a screen session
$ vboxheadless -s "ubuntu-12.04.3-NOINITRD"  # run virtualbox in non-gui mode

Cntrl-a d          # detach from the screen session (machine keeps running)
</pre>
</div>
<p>
note: this will always boot the default kernel (specified in the grub menu)
(and it takes about 1 minute to boot).  If the default kernel is not the
one you want to boot, you can change the default kernel:
</p>
<div class="org-src-container">

<pre class="src src-bash">(1) in /etc/default/grub, set GRUB_DEFAULT to the number kernel entry you want:
    GRUB_DEFAULT=0    # the default kernel is the one in entry 0
                      # change it to be the entry you want as the default (0,1,2,...)

   you can list the kernels in which entry:
    grep menuentry /boot/grub/grub.cfg

(2) then run:
    sudo update-grub
</pre>
</div>



<p>
&lt;h4&gt;Starting an OS inside of VirtualBox:&lt;/h4&gt;
</p>

<p>
When virtualbox is run in gui mode, and you first boot up the system, 
you will see the grub menu with a list of kernels to boot.  Use the arrow 
keys to scroll through the list and then hit the Enter key to choose your 
kernel.  If you don't select one, after 10 seconds the default kernel 
(at the top of the list) is booted.  If you run in non-gui mode, the
default kernel boots.
</p>


<p>
After the kernel boots in your VM you can log into the console window.  
However, it will be easier to work on your virtual machine by ssh'ing into it.
To do this specify port number 10022 and the CSmachine on which you are 
running virtualbox.  There is one user account (swatcs) with the starting 
point VM, its password (swatcs.45):
</p>
<div class="org-src-container">

<pre class="src src-bash">ssh -p 10022 swatcs@ginger
</pre>
</div>


<p>
The virtualbox image is set up with a single user account:
&lt;code&gt;swatcs&lt;/code&gt;.  The password is &lt;code&gt;swatcs.45&lt;/code&gt;.
You can change any of your user account passwords, by running the 
&lt;code&gt;passwd&lt;/code&gt; command.  You can also add new users to the system 
using the &lt;code&gt;adduser&lt;/code&gt; command.
</p>

<p>
&lt;h4&gt;Shutting down or rebooting an OS:&lt;/h4&gt;
</p>

<p>
To shut down your kernel:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo sync
$ sudo sync
$ sudo halt -p     # halt and power down
</pre>
</div>

<p>
To reboot your kernel:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo sync
$ sudo sync
$ sudo reboot
</pre>
</div>



<p>
&lt;h4&gt;Shutting down VirtualBox:&lt;/h4&gt;
</p>

<p>
First shut down your kernel, then exit virtualbox using the menu options.
If you run in non-gui mode, use CNTRL-C to exit vboxheadless after halting
your kernel.
</p>

<p>
&lt;div class="TagLine" id="building"&gt; 
</p>
</div>
</div>
