Courses/4420/Lectures/Hardening/SysCalls/lab-virtual-box-setup.org
* Compiling, Installing and Booting your Kernel changes in VirtualBox 

You will compile and build your changes to the Linux kernel on your 
CS machine in /local/, and then install your built kernel on the
virtualbox VM.


<font color="blue"><h3>Getting a copy of the Linux Source</h3></font>
These steps only need to be done once (or whenever you want to grab 
a fresh copy of the code):



	1.  copy the kernel source into your /local directory:
#+begin_src bash
 $ cp /local/vm/linux-2.6.32.44.tar.bz2 /local/you_n_partner/. 
#+end_src

1.  unzip and untar the file:
#+begin_src bash
 $ cd /local/you_n_partner
 $ tar xjf linux-2.6.32.44.tar.bz2 
#+end_src
1.  copy the starting point config file into .config in 
linux-2.6.32.44 and run make menuconfig:
#+begin_src bash
 $ cd linux-2.6.32.44 
 $ cp /scratch/vm/config-noinitrd .config
 $ make menuconfig 	# just choose Exit with the arrow keys
#+end_src
1.  follow Option 1 below for building the kernel the first time.


<font color="blue"><h3>Building the kernel</h3></font>

There are two options for building the kernel:
<ul>
1.  Option 1, builds 
Debian kernel image and header packages for installing.  You should
use this option at least once at the begining of each new lab assignment,
and if you add or modify .h files.
1.  Option 2, just re-compiles the kernel executable (bzImage) file
and is useful for installing and booting incremental changes to the
kernel.
</ul>
If you have problems with the Option 2 build or install, I recommend doing an
Option 1 build and remove and re-install the kernel packages.


<h3>Option 1: Building kernel image (and kernel header) packages</h3>

1.  Set this environment variable once in the shell you are compiling
in (it will use a parallel compile and result in a faster total compile time):
#+begin_src bash
export CONCURRENCY_LEVEL=4    # anything higher than 4 doesn't help 
#+end_src
1.  Do this the first time, and maybe other builds, but you do
not always have to do this on every build (it is like a 'make clean'):
#+begin_src bash
# NOTE: make-kpkg clean wipes out everything that has been compiled before.
#  For the very first build you need to do this step, but for subsequent 
#  builds you may want to not do it, and only if package builds are 
#  failing in odd ways try doing a make-kpkg clean to re-build 
#  everything from scratch ("from scratch" takes ~5 minutes)
$ <b>cd /local/you_n_partner/linux-2.6.32.44</b>
$ <b>fakeroot make-kpkg clean</b>
#+end_src

1.  build the kernel packages you want to build (typically kernel_headers
and/or usually kernel_image).  

 
#+begin_src bash
# NOTE: in the linux .config file is a variable that is set to 
#       append a local name to your kernel version (in this example
#       it is set to "-lab3", you can change this in the .config file
#       for other lab assignment builds 
#         CONFIG_LOCALVERSION="-lab3"
#       Anytime you change .config, you need to re-run <b>make menuconfig</b>   
#
#  (a clean build will take about 5 minutes):
$  <b>fakeroot make-kpkg --revision=1.0 kernel_image</b>

# if you add new kernel header files, or change existing ones, you need 
# to build a kernel headers package that contains your changed files too:
$  <b>fakeroot make-kpkg --revision=1.0  kernel_headers</b>
#+end_src
make-kpkg creates files named:
#+begin_src bash
../linux-image-2.6.32.44-lab3_1.0_amd64.deb 
../linux-headers-2.6.32.44-lab3_1.0_amd64.deb
#+end_src
You also can list both kernel_image and kernel_headers in a single make-kpkg 
command line.
#+begin_src bash
$  <b>fakeroot make-kpkg --revision=1.0  kernel_image kernel_headers</b>
#+end_src

<b>NOTE:</b> if this is a rebuild of a previous package, then you will 
need to remove the previous package before installing the new one:
#+begin_src bash
# To remove a previous version of an installed package, on your VM
dpkg -r linux-image-2.6.32.44-lab3
#+end_src



<h3>Option 2: Recompiling the kernel bzImage file</h3>

Set this environment variable once in the shell you are compiling
in (it will use a parallel compile and result in a faster total compile time):
#+begin_src bash
export CONCURRENCY_LEVEL=4    # anything higher than 4 doesn't help 
#+end_src


From the top-level linux source directory (<b>cd 
/local/you_n_partner/linux-2.6.32.44</b>), do:
#+begin_src bash
make bzImage
#+end_src
If the build is failing in odd ways (not due to errors in files you have
changed), then you can try doing a make clean (and make dep) and try 
make bzImage again.  However, it may be easier to do an Option 1 rebuild
at this point.
#+begin_src bash
# you don't always need to do this, but if you have changed include files  
# things don't seem to be getting built correctly do:
$ make clean

# do this only if you have added or removed #includes from existing
# source or header files (you need to rebuild the dependencies in
# this case):
$ make dep
#+end_src
Remember that if you change .h files you need to copy them over to your
VM if test programs there need to use these .h files.  You can do this by
hand, but again, it is often easier to just rebuild the kernel_headers
package, remove the old one, and install the new version.

<font color="blue"><h3>Installing and booting your kernel</h3></font>

How you install your kernel changes depends on how you built it
(Option 1 (kernel package build) or Option 2 (bzImage build)).

<h3>Option 1: Installing kernel packages:</h3>
#+begin_src bash
# (a) from your CS machine, copy the kernel packages to your VM:
#     (I'm using ginger as an example CS machine name)
$ <b>scp -P 10022 linux-image-2.6.32.44-lab3_1.0_amd64.deb swatcs@ginger:.</b>
$ <b>scp -P 10022 linux-headers-2.6.32.44-lab3_1.0_amd64.deb swatcs@ginger:.
</b>
# (b) Next, from within your VM, install the packages:
#     from root's home directory (or wherever you scp the files) 
$ <b>sudo dpkg -i linux-image-2.6.32.44-lab3_1.0_amd64.deb</b>
$ <b>sudo dpkg -i linux-headers-2.6.32.44-lab3_1.0_amd64.deb</b> 
<font color="red">note:</font> ignore this error message when installing the headers package (it is not really an error):
Error! Your kernel headers for 2.6.34-lab3 cannot be found.

# (c) reboot your VM and choose your new kernel from the grub menu
$ <b> sudo sync; sudo sync; sudo reboot</b>

# (d) login and verify that the new version of your kernel rebooted 
#     check both the name of the kernel (does it have the -lab3 extention)
#     and the build date (is it a new build or old one)
$ <b>uname -a</b>

# <font color="red">note:</font> If this is a re-install of a kernel package 
# that you have already installed (i.e. the same -lab3 flag as an 
# installed kernel package), you need to first remove the 
# old package(s), before you do the dpkg -i of the new ones: 
$ <b>dpkg -r linux-image-2.6.32.44-lab3</b> 

# Use the -I option to dpkg to list info about the package file, 
# including its name (used in the -r option)
$ <b>dpkg -I linux-image-2.6.32.44-lab3_1.0_amd64.deb</b> 
#+end_src


<h3>Option 2: Installing bzImage and System.map files:</h3>
#+begin_src bash
# (a) from your CS machine, copy the kernel bzImage and System.map files
      to your VM: (I'm using ginger as an example CS machine name)
$ cd /local/you_n_partner/linux-2.6.32
$ <b>scp -P 10022 System.map swatcs@ginger:.</b>
$ <b>scp -P 10022 arch/x86_64/boot/bzImage swatcs@ginger:.</b>

# (b) ssh into your VM and install the bzImage and System.map files
#     (replace the vmlinux... executable in /boot with the bzImage 
#      be careful that you are replacing the right one...using mv -i will 
#      give you a chance abort before overwriting the wrong one)
$ <b>ssh -p 1022 swatcs@ginger</b>
$ <b>ls -l</b>   # verify dates on bzImage and System.map files you scp'ed over
$ <b>sudo mv -i bzImage /boot/vmlinux-2.6.32.44-lab3</b>
$ <b>sudo mv -i System.map /boot/System.map-2.6.32.44-lab3</b>

# (c) run update-grub
$ <b>sudo update-grub</b>

# (d) sync, halt and then reboot into your new kernel
$ <b>sudo sync</b>
$ <b>sudo sync</b>
$ <b>sudo reboot</b>  

# if rebooting is failing, first try booting into the cs45 kernel and then do:
$ <b>sudo sync</b>
$ <b>sudo sync</b>
$ <b>sudo halt -p</b>  # turn off and then back on the VM and boot your kernel
#+end_src

<hr>

<font color="red">An Important Note about Modifying Kernel Source Files: </font>
</b> 
<br>We do not back-up files in each machine's <tt>/local</tt> directory.  
As a result, you should periodically copy files into your private
cs45 subdirectory in /home, which we do back-up 
(<a href="http://www.cs.swarthmore.edu/help/lostfile.html">
Retrieving Lost Files</a>).  


I suggest that you use git to do this:

1.  one of you should create a shared bare 
<a href="howto_cvs.html">git</a> repository (and share it with three users: 
you, your partner, and your CS45 shared account user).  
1.  You and your partner should clone a copy in your 
private /home/you/cs45 subdirectories.
1.  Your shared CS45 account user should clone a copy into /local on your
assigned machine.

As you work, periodically add, commit, and push 
changes to the linux kernel files you modify (and also to any user-level
programs you write as part of a lab assignment). 


Make sure to include in your git repo
<b>only the linux source and header files that you modify for the current 
lab assignment, and not the entire linux kernel source tree, which will eat 
up your account quota</b>.  These are the files that you will submit for 
each lab assignment, and the ones that you cannot recover.  If you 
accidentally delete other kernel files (ones you aren't changing), you can 
always get a copy of them from the linux source starting point.
If you lose files you have modified, then can then get a back-up from
your git repo.  

