Courses/4420/Lectures/Hardening/SysCalls/lab-virtual-box-setup.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Compiling, Installing and Booting your Kernel changes in VirtualBox</h2>
<div class="outline-text-2" id="text-3">
<p>
You will compile and build your changes to the Linux kernel on your 
CS machine in <i>local</i>, and then install your built kernel on the
virtualbox VM.
</p>


<p>
&lt;font color="blue"&gt;&lt;h3&gt;Getting a copy of the Linux Source&lt;/h3&gt;&lt;/font&gt;
These steps only need to be done once (or whenever you want to grab 
a fresh copy of the code):
</p>



<ol class="org-ol">
<li>copy the kernel source into your /local directory:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-bash">$ cp /local/vm/linux-2.6.32.44.tar.bz2 /local/you_n_partner/.
</pre>
</div>

<ol class="org-ol">
<li>unzip and untar the file:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-bash">$ cd /local/you_n_partner
$ tar xjf linux-2.6.32.44.tar.bz2
</pre>
</div>
<ol class="org-ol">
<li>copy the starting point config file into .config in 
</li>
</ol>
<p>
linux-2.6.32.44 and run make menuconfig:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ cd linux-2.6.32.44 
$ cp /scratch/vm/config-noinitrd .config
$ make menuconfig      # just choose Exit with the arrow keys
</pre>
</div>
<ol class="org-ol">
<li>follow Option 1 below for building the kernel the first time.
</li>
</ol>


<p>
&lt;font color="blue"&gt;&lt;h3&gt;Building the kernel&lt;/h3&gt;&lt;/font&gt;
</p>

<p>
There are two options for building the kernel:
&lt;ul&gt;
</p>
<ol class="org-ol">
<li>Option 1, builds 
</li>
</ol>
<p>
Debian kernel image and header packages for installing.  You should
use this option at least once at the begining of each new lab assignment,
and if you add or modify .h files.
</p>
<ol class="org-ol">
<li>Option 2, just re-compiles the kernel executable (bzImage) file
</li>
</ol>
<p>
and is useful for installing and booting incremental changes to the
kernel.
&lt;/ul&gt;
If you have problems with the Option 2 build or install, I recommend doing an
Option 1 build and remove and re-install the kernel packages.
</p>


<p>
&lt;h3&gt;Option 1: Building kernel image (and kernel header) packages&lt;/h3&gt;
</p>

<ol class="org-ol">
<li>Set this environment variable once in the shell you are compiling
</li>
</ol>
<p>
in (it will use a parallel compile and result in a faster total compile time):
</p>
<div class="org-src-container">

<pre class="src src-bash">export CONCURRENCY_LEVEL=4    # anything higher than 4 doesn't help
</pre>
</div>
<ol class="org-ol">
<li>Do this the first time, and maybe other builds, but you do
</li>
</ol>
<p>
not always have to do this on every build (it is like a 'make clean'):
</p>
<div class="org-src-container">

<pre class="src src-bash"># NOTE: make-kpkg clean wipes out everything that has been compiled before.
#  For the very first build you need to do this step, but for subsequent 
#  builds you may want to not do it, and only if package builds are 
#  failing in odd ways try doing a make-kpkg clean to re-build 
#  everything from scratch ("from scratch" takes ~5 minutes)
$ &lt;b&gt;cd /local/you_n_partner/linux-2.6.32.44&lt;/b&gt;
$ &lt;b&gt;fakeroot make-kpkg clean&lt;/b&gt;
</pre>
</div>

<ol class="org-ol">
<li>build the kernel packages you want to build (typically kernel<sub>headers</sub>
</li>
</ol>
<p>
and/or usually kernel<sub>image</sub>).  
</p>


<div class="org-src-container">

<pre class="src src-bash"># NOTE: in the linux .config file is a variable that is set to 
#       append a local name to your kernel version (in this example
#       it is set to "-lab3", you can change this in the .config file
#       for other lab assignment builds 
#         CONFIG_LOCALVERSION="-lab3"
#       Anytime you change .config, you need to re-run &lt;b&gt;make menuconfig&lt;/b&gt;   
#
#  (a clean build will take about 5 minutes):
$  &lt;b&gt;fakeroot make-kpkg --revision=1.0 kernel_image&lt;/b&gt;

# if you add new kernel header files, or change existing ones, you need 
# to build a kernel headers package that contains your changed files too:
$  &lt;b&gt;fakeroot make-kpkg --revision=1.0  kernel_headers&lt;/b&gt;
</pre>
</div>
<p>
make-kpkg creates files named:
</p>
<div class="org-src-container">

<pre class="src src-bash">../linux-image-2.6.32.44-lab3_1.0_amd64.deb 
../linux-headers-2.6.32.44-lab3_1.0_amd64.deb
</pre>
</div>
<p>
You also can list both kernel<sub>image</sub> and kernel<sub>headers</sub> in a single make-kpkg 
command line.
</p>
<div class="org-src-container">

<pre class="src src-bash">$  &lt;b&gt;fakeroot make-kpkg --revision=1.0  kernel_image kernel_headers&lt;/b&gt;
</pre>
</div>

<p>
&lt;b&gt;NOTE:&lt;/b&gt; if this is a rebuild of a previous package, then you will 
need to remove the previous package before installing the new one:
</p>
<div class="org-src-container">

<pre class="src src-bash"># To remove a previous version of an installed package, on your VM
dpkg -r linux-image-2.6.32.44-lab3
</pre>
</div>



<p>
&lt;h3&gt;Option 2: Recompiling the kernel bzImage file&lt;/h3&gt;
</p>

<p>
Set this environment variable once in the shell you are compiling
in (it will use a parallel compile and result in a faster total compile time):
</p>
<div class="org-src-container">

<pre class="src src-bash">export CONCURRENCY_LEVEL=4    # anything higher than 4 doesn't help
</pre>
</div>


<p>
From the top-level linux source directory (&lt;b&gt;cd 
/local/you<sub>n</sub><sub>partner</sub>/linux-2.6.32.44&lt;/b&gt;), do:
</p>
<div class="org-src-container">

<pre class="src src-bash">make bzImage
</pre>
</div>
<p>
If the build is failing in odd ways (not due to errors in files you have
changed), then you can try doing a make clean (and make dep) and try 
make bzImage again.  However, it may be easier to do an Option 1 rebuild
at this point.
</p>
<div class="org-src-container">

<pre class="src src-bash"># you don't always need to do this, but if you have changed include files  
# things don't seem to be getting built correctly do:
$ make clean

# do this only if you have added or removed #includes from existing
# source or header files (you need to rebuild the dependencies in
# this case):
$ make dep
</pre>
</div>
<p>
Remember that if you change .h files you need to copy them over to your
VM if test programs there need to use these .h files.  You can do this by
hand, but again, it is often easier to just rebuild the kernel<sub>headers</sub>
package, remove the old one, and install the new version.
</p>

<p>
&lt;font color="blue"&gt;&lt;h3&gt;Installing and booting your kernel&lt;/h3&gt;&lt;/font&gt;
</p>

<p>
How you install your kernel changes depends on how you built it
(Option 1 (kernel package build) or Option 2 (bzImage build)).
</p>

<p>
&lt;h3&gt;Option 1: Installing kernel packages:&lt;/h3&gt;
</p>
<div class="org-src-container">

<pre class="src src-bash"># (a) from your CS machine, copy the kernel packages to your VM:
#     (I'm using ginger as an example CS machine name)
$ &lt;b&gt;scp -P 10022 linux-image-2.6.32.44-lab3_1.0_amd64.deb swatcs@ginger:.&lt;/b&gt;
$ &lt;b&gt;scp -P 10022 linux-headers-2.6.32.44-lab3_1.0_amd64.deb swatcs@ginger:.
&lt;/b&gt;
# (b) Next, from within your VM, install the packages:
#     from root's home directory (or wherever you scp the files) 
$ &lt;b&gt;sudo dpkg -i linux-image-2.6.32.44-lab3_1.0_amd64.deb&lt;/b&gt;
$ &lt;b&gt;sudo dpkg -i linux-headers-2.6.32.44-lab3_1.0_amd64.deb&lt;/b&gt; 
&lt;font color="red"&gt;note:&lt;/font&gt; ignore this error message when installing the headers package (it is not really an error):
Error! Your kernel headers for 2.6.34-lab3 cannot be found.

# (c) reboot your VM and choose your new kernel from the grub menu
$ &lt;b&gt; sudo sync; sudo sync; sudo reboot&lt;/b&gt;

# (d) login and verify that the new version of your kernel rebooted 
#     check both the name of the kernel (does it have the -lab3 extention)
#     and the build date (is it a new build or old one)
$ &lt;b&gt;uname -a&lt;/b&gt;

# &lt;font color="red"&gt;note:&lt;/font&gt; If this is a re-install of a kernel package 
# that you have already installed (i.e. the same -lab3 flag as an 
# installed kernel package), you need to first remove the 
# old package(s), before you do the dpkg -i of the new ones: 
$ &lt;b&gt;dpkg -r linux-image-2.6.32.44-lab3&lt;/b&gt; 

# Use the -I option to dpkg to list info about the package file, 
# including its name (used in the -r option)
$ &lt;b&gt;dpkg -I linux-image-2.6.32.44-lab3_1.0_amd64.deb&lt;/b&gt;
</pre>
</div>


<p>
&lt;h3&gt;Option 2: Installing bzImage and System.map files:&lt;/h3&gt;
</p>
<div class="org-src-container">

<pre class="src src-bash"># (a) from your CS machine, copy the kernel bzImage and System.map files
      to your VM: (I'm using ginger as an example CS machine name)
$ cd /local/you_n_partner/linux-2.6.32
$ &lt;b&gt;scp -P 10022 System.map swatcs@ginger:.&lt;/b&gt;
$ &lt;b&gt;scp -P 10022 arch/x86_64/boot/bzImage swatcs@ginger:.&lt;/b&gt;

# (b) ssh into your VM and install the bzImage and System.map files
#     (replace the vmlinux... executable in /boot with the bzImage 
#      be careful that you are replacing the right one...using mv -i will 
#      give you a chance abort before overwriting the wrong one)
$ &lt;b&gt;ssh -p 1022 swatcs@ginger&lt;/b&gt;
$ &lt;b&gt;ls -l&lt;/b&gt;   # verify dates on bzImage and System.map files you scp'ed over
$ &lt;b&gt;sudo mv -i bzImage /boot/vmlinux-2.6.32.44-lab3&lt;/b&gt;
$ &lt;b&gt;sudo mv -i System.map /boot/System.map-2.6.32.44-lab3&lt;/b&gt;

# (c) run update-grub
$ &lt;b&gt;sudo update-grub&lt;/b&gt;

# (d) sync, halt and then reboot into your new kernel
$ &lt;b&gt;sudo sync&lt;/b&gt;
$ &lt;b&gt;sudo sync&lt;/b&gt;
$ &lt;b&gt;sudo reboot&lt;/b&gt;  

# if rebooting is failing, first try booting into the cs45 kernel and then do:
$ &lt;b&gt;sudo sync&lt;/b&gt;
$ &lt;b&gt;sudo sync&lt;/b&gt;
$ &lt;b&gt;sudo halt -p&lt;/b&gt;  # turn off and then back on the VM and boot your kernel
</pre>
</div>

<p>
&lt;hr&gt;
</p>

<p>
&lt;font color="red"&gt;An Important Note about Modifying Kernel Source Files: &lt;/font&gt;
&lt;/b&gt; 
&lt;br&gt;We do not back-up files in each machine's &lt;tt&gt;/local&lt;/tt&gt; directory.  
As a result, you should periodically copy files into your private
cs45 subdirectory in /home, which we do back-up 
(&lt;a href="<a href="http://www.cs.swarthmore.edu/help/lostfile.html">http://www.cs.swarthmore.edu/help/lostfile.html</a>"&gt;
Retrieving Lost Files&lt;/a&gt;).  
</p>


<p>
I suggest that you use git to do this:
</p>

<ol class="org-ol">
<li>one of you should create a shared bare 
</li>
</ol>
<p>
&lt;a href="howto<sub>cvs</sub>.html"&gt;git&lt;/a&gt; repository (and share it with three users: 
you, your partner, and your CS45 shared account user).  
</p>
<ol class="org-ol">
<li>You and your partner should clone a copy in your 
</li>
</ol>
<p>
private /home/you/cs45 subdirectories.
</p>
<ol class="org-ol">
<li>Your shared CS45 account user should clone a copy into /local on your
</li>
</ol>
<p>
assigned machine.
</p>

<p>
As you work, periodically add, commit, and push 
changes to the linux kernel files you modify (and also to any user-level
programs you write as part of a lab assignment). 
</p>


<p>
Make sure to include in your git repo
&lt;b&gt;only the linux source and header files that you modify for the current 
lab assignment, and not the entire linux kernel source tree, which will eat 
up your account quota&lt;/b&gt;.  These are the files that you will submit for 
each lab assignment, and the ones that you cannot recover.  If you 
accidentally delete other kernel files (ones you aren't changing), you can 
always get a copy of them from the linux source starting point.
If you lose files you have modified, then can then get a back-up from
your git repo.  
</p>
</div>
</div>
