Courses/4420/Lectures/Hardening/SysCalls/lab-virtual-box-setup.org
* ssh'ing and scp'ing from the host PC to your VM

Use <tt>ssh</tt> to log in to your VM from the assigned CS lab
machine from which you are running virtualbox:
#+begin_src bash
$ ssh -p 10022 swatcs@ginger
#+end_src
Use <tt>scp</tt> to transfer files between your VM and your
CS machine.  Here are some examples (and yes, it is <tt>-P</tt> for scp 
and <tt>-p</tt> for ssh):
#+begin_src bash
$ scp -P 10022  file.c swatcs@ginger:.
$ scp -P 10022  *.c swatcs@ginger:.          # copy a bunch of .c files
$ scp -P 10022  -r dirname swatcs@ginger:.   # recurively copy a directory
#+end_src
From your VM you can scp to your CS user account.  Here are some
examples:
#+begin_src bash
$ scp file username@machinename:/home/username/cs45/labs/lab2/.
$ scp file cs45username@machinename:/local/you_n_partner/lab2/.
#+end_src

* Debugging the Kernel 

You do not have valgrind to help you debug at the kernel level, but
you can use the kernel's kgdb support to remotely attach gdb to your
running kernel and debug it.  You can also add debugging statements
to your kernel using printk. 

<h4>printk</h4>

A useful way to see what your kernel code is doing is to
add debugging printk statements to print out some execution 
state as as it runs.  printk is similar to printf, except remember
that floating point values are not supported at kernel level.


printk output goes to the console and to log files 
on your VM in <tt>/var/log/kern.log</tt> and  <tt>/var/log/syslog</tt>. 
You can open them in vim to printk output.  Also, running tail -f 
on one of these files will let you see printk output as your kernel runs:
#+begin_src bash   
$ tail -f /var/log/kern.log
#+end_src
If your kernel crashes, it is likely that some of the printk output 
has not yet been written to the log files.  As a result, you may want 
to jot down the last printk output on the console before rebooting.  Also, 
be very careful about where you put printk calls; you don't want 
them on a code path that is executed many times per second.


printk output should also show up on the console window.  If not,           
run this command, and then it should:
#+begin_src bash
sudo dmesg -n 7
#+end_src


 
<h4>kgdb</h4>

You can use the linux kernel's built-in support for kgdb to attach gdb
to your running kernel and debug it.  The default config file you copied
over already builds the kernel image with kgdb support enabled.  You need
to follow some steps on boot to connect gdb running on the host machine
(your CS machine) to the linux kernel VM running in VirtualBox.  
(this link contains some nice screen dumps showing some of these steps:
<a href="http://www.linuxforu.com/2011/03/kgdb-with-virtualbox-debug-live-kernel/">KGDB with VirtualBox</a>).

<h4>Steps to attach gdb to your VM:</h4>

1.  Run virtualbox, but do not boot a VM (or halt your VM if already
running), and then configure the serial port:


Click on your virtual machine instance in the VirtualBox Manager
window (your VM should not be running), and choose Settings.  Select
the "Serial Ports" tab, choose Port 1, and  enter the following and the
choose OK:
#+begin_src bash
(1) Check the "Enable Serial Port" box
(2) Choose COM1 for "Port Number"
(3) Choose HostPipe for "Port Mode"
(4) Check the "Create Pipe" box
(5) Enter /local/me_and_pal/serial in the "Port/File Path" box  
    (where /local/me_and_pal/ is the name of your subdirectory /local on
     on your machine in which your virtualbox image and linux source are) 
#+end_src


1.  Start the boot of your VM, and at the grub menu choose 
the kernel version you want, and then enter <tt>e</tt> to edit its information.
Scroll down to the linux line and append the following to it (and these
are zeros not ohs):
#+begin_src bash

kgdboc=ttyS0,115200 kgdbwait

# The result will look something like:
linux /boot/vmlinux/.... \
...  rw kgdboc=ttySO,115200 kgdbwait
#+end_src
Then hit F10 to continue to boot.  Your VM will continue booting but not
finish, printing a message:
#+begin_src bash
kgdb: Waiting for connection from remote gdb..." message
#+end_src


1.  At this point, in a terminal on the host machine (your CS machine) run:
#+begin_src bash
socat -d -d /local/me_and_pal/serial PTY:

# you should see output like this:
2014/01/31 14:13:24 socat[27748] N opening connection to AF=1 "/local/me_n_pal/serial"
2014/01/31 14:13:24 socat[27748] N successfully connected from local address AF=1 "qp\xEE\x7E"
2014/01/31 14:13:24 socat[27748] N successfully connected via 
2014/01/31 14:13:24 socat[27748] N PTY is /dev/pts/16
2014/01/31 14:13:24 socat[27748] N starting data transfer loop with FDs [3,3] and [4,4]
#+end_src 
Note: the <tt>/dev/pts/16</tt> part will likely be different, and use
the one that yours lists as the target in gdb.


Do not terminate socat; it needs to be running in the background to use
the pseudo terminal to connect gdb.


1.  in another terminal on the host machine (your lab machine) run gdb
and attacke to the remote target:
#+begin_src bash
$ cd /local/me_and_pal/linux-2.6.32.44/
$ gdb ./vmlinux
...
...
Reading symbols from /local/me_and_pal/linux-2.6.32.44/vmlinux...done.

(gdb) target remote /dev/pts/16       # or whatever the number is from socat 
Remote debugging using /dev/pts/16
kgdb_breakpoint () at kernel/kgdb.c:1718
1718            wmb(); /* Sync point after breakpoint */
#+end_src
At this point you can use gdb commands to debug your kernel code: set 
breakpoints in your kernel functions, step and next through the execution
of code, print variables, ...  


* Troubleshooting VirtualBox and Linux
 
I'll post answers to virtualbox and Linux questions here.
<ul>
1.  Changing the name of your kernel.  For each lab assignment you may want to
change the name of the kernel that is being built.  This is done by changing
the following definition in the <tt>.config</tt> file in the
linux source directory, and then running make menuconfig again.
#+begin_src bash
$ vi .config
  CONFIG_LOCALVERSION="-lab3"   # change -lab3 string to whatever you'd like
$ make menuconfig 	# just choose Exit with the arrow keys
#+end_src



1.  Changing the size of physical memory used by linux (and of course
you cannot make it bigger than what is there).
#+begin_src bash
# in your virtual machine edit the file /etc/default/grub
$ sudo vi /etc/default/grub

# add the size of physical memory you want to GRUB_CMD_LINE_LINUX:
GRUB_CMDLINE_LINUX="mem=512m"

# run update-grub and reboot cat out /proc/meminfo to see the change
sudo update-grub
sudo sync
sudo sync
sudo reboot
#+end_src


1.  What was the old (initrd) way of building the kernel packages (used 
in lab2)?
#+begin_src bash
fakeroot make-kpkg --initrd --revision=1.0 --append-to-version -lab2  kernel_image
fakeroot make-kpkg --initrd --revision=1.0 --append-to-version -lab2  kernel_headers
#+end_src


