Courses/4420/Lectures/Hardening/SysCalls/lab-virtual-box-setup.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> ssh'ing and scp'ing from the host PC to your VM</h2>
<div class="outline-text-2" id="text-4">
<p>
Use &lt;tt&gt;ssh&lt;/tt&gt; to log in to your VM from the assigned CS lab
machine from which you are running virtualbox:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ ssh -p 10022 swatcs@ginger
</pre>
</div>
<p>
Use &lt;tt&gt;scp&lt;/tt&gt; to transfer files between your VM and your
CS machine.  Here are some examples (and yes, it is &lt;tt&gt;-P&lt;/tt&gt; for scp 
and &lt;tt&gt;-p&lt;/tt&gt; for ssh):
</p>
<div class="org-src-container">

<pre class="src src-bash">$ scp -P 10022  file.c swatcs@ginger:.
$ scp -P 10022  *.c swatcs@ginger:.          # copy a bunch of .c files
$ scp -P 10022  -r dirname swatcs@ginger:.   # recurively copy a directory
</pre>
</div>
<p>
From your VM you can scp to your CS user account.  Here are some
examples:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ scp file username@machinename:/home/username/cs45/labs/lab2/.
$ scp file cs45username@machinename:/local/you_n_partner/lab2/.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Debugging the Kernel</h2>
<div class="outline-text-2" id="text-5">
<p>
You do not have valgrind to help you debug at the kernel level, but
you can use the kernel's kgdb support to remotely attach gdb to your
running kernel and debug it.  You can also add debugging statements
to your kernel using printk. 
</p>

<p>
&lt;h4&gt;printk&lt;/h4&gt;
</p>

<p>
A useful way to see what your kernel code is doing is to
add debugging printk statements to print out some execution 
state as as it runs.  printk is similar to printf, except remember
that floating point values are not supported at kernel level.
</p>


<p>
printk output goes to the console and to log files 
on your VM in &lt;tt&gt;/var/log/kern.log&lt;/tt&gt; and  &lt;tt&gt;/var/log/syslog&lt;/tt&gt;. 
You can open them in vim to printk output.  Also, running tail -f 
on one of these files will let you see printk output as your kernel runs:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ tail -f /var/log/kern.log
</pre>
</div>
<p>
If your kernel crashes, it is likely that some of the printk output 
has not yet been written to the log files.  As a result, you may want 
to jot down the last printk output on the console before rebooting.  Also, 
be very careful about where you put printk calls; you don't want 
them on a code path that is executed many times per second.
</p>


<p>
printk output should also show up on the console window.  If not,           
run this command, and then it should:
</p>
<div class="org-src-container">

<pre class="src src-bash">sudo dmesg -n 7
</pre>
</div>



<p>
&lt;h4&gt;kgdb&lt;/h4&gt;
</p>

<p>
You can use the linux kernel's built-in support for kgdb to attach gdb
to your running kernel and debug it.  The default config file you copied
over already builds the kernel image with kgdb support enabled.  You need
to follow some steps on boot to connect gdb running on the host machine
(your CS machine) to the linux kernel VM running in VirtualBox.  
(this link contains some nice screen dumps showing some of these steps:
&lt;a href="<a href="http://www.linuxforu.com/2011/03/kgdb-with-virtualbox-debug-live-kernel/">http://www.linuxforu.com/2011/03/kgdb-with-virtualbox-debug-live-kernel/</a>"&gt;KGDB with VirtualBox&lt;/a&gt;).
</p>

<p>
&lt;h4&gt;Steps to attach gdb to your VM:&lt;/h4&gt;
</p>

<ol class="org-ol">
<li>Run virtualbox, but do not boot a VM (or halt your VM if already
</li>
</ol>
<p>
running), and then configure the serial port:
</p>


<p>
Click on your virtual machine instance in the VirtualBox Manager
window (your VM should not be running), and choose Settings.  Select
the "Serial Ports" tab, choose Port 1, and  enter the following and the
choose OK:
</p>
<div class="org-src-container">

<pre class="src src-bash">(1) Check the "Enable Serial Port" box
(2) Choose COM1 for "Port Number"
(3) Choose HostPipe for "Port Mode"
(4) Check the "Create Pipe" box
(5) Enter /local/me_and_pal/serial in the "Port/File Path" box  
    (where /local/me_and_pal/ is the name of your subdirectory /local on
     on your machine in which your virtualbox image and linux source are)
</pre>
</div>


<ol class="org-ol">
<li>Start the boot of your VM, and at the grub menu choose 
</li>
</ol>
<p>
the kernel version you want, and then enter &lt;tt&gt;e&lt;/tt&gt; to edit its information.
Scroll down to the linux line and append the following to it (and these
are zeros not ohs):
</p>
<div class="org-src-container">

<pre class="src src-bash">kgdboc=ttyS0,115200 kgdbwait

# The result will look something like:
linux /boot/vmlinux/.... \
...  rw kgdboc=ttySO,115200 kgdbwait
</pre>
</div>
<p>
Then hit F10 to continue to boot.  Your VM will continue booting but not
finish, printing a message:
</p>
<div class="org-src-container">

<pre class="src src-bash">kgdb: Waiting for connection from remote gdb..." message
</pre>
</div>


<ol class="org-ol">
<li>At this point, in a terminal on the host machine (your CS machine) run:
</li>
</ol>
<div class="org-src-container">

<pre class="src src-bash">socat -d -d /local/me_and_pal/serial PTY:

# you should see output like this:
2014/01/31 14:13:24 socat[27748] N opening connection to AF=1 "/local/me_n_pal/serial"
2014/01/31 14:13:24 socat[27748] N successfully connected from local address AF=1 "qp\xEE\x7E"
2014/01/31 14:13:24 socat[27748] N successfully connected via 
2014/01/31 14:13:24 socat[27748] N PTY is /dev/pts/16
2014/01/31 14:13:24 socat[27748] N starting data transfer loop with FDs [3,3] and [4,4]
</pre>
</div>
<p>
Note: the &lt;tt&gt;/dev/pts/16&lt;/tt&gt; part will likely be different, and use
the one that yours lists as the target in gdb.
</p>


<p>
Do not terminate socat; it needs to be running in the background to use
the pseudo terminal to connect gdb.
</p>


<ol class="org-ol">
<li>in another terminal on the host machine (your lab machine) run gdb
</li>
</ol>
<p>
and attacke to the remote target:
</p>
<div class="org-src-container">

<pre class="src src-bash">$ cd /local/me_and_pal/linux-2.6.32.44/
$ gdb ./vmlinux
...
...
Reading symbols from /local/me_and_pal/linux-2.6.32.44/vmlinux...done.

(gdb) target remote /dev/pts/16       # or whatever the number is from socat 
Remote debugging using /dev/pts/16
kgdb_breakpoint () at kernel/kgdb.c:1718
1718            wmb(); /* Sync point after breakpoint */
</pre>
</div>
<p>
At this point you can use gdb commands to debug your kernel code: set 
breakpoints in your kernel functions, step and next through the execution
of code, print variables, &#x2026;  
</p>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Troubleshooting VirtualBox and Linux</h2>
<div class="outline-text-2" id="text-6">
<p>
I'll post answers to virtualbox and Linux questions here.
&lt;ul&gt;
</p>
<ol class="org-ol">
<li>Changing the name of your kernel.  For each lab assignment you may want to
</li>
</ol>
<p>
change the name of the kernel that is being built.  This is done by changing
the following definition in the &lt;tt&gt;.config&lt;/tt&gt; file in the
linux source directory, and then running make menuconfig again.
</p>
<div class="org-src-container">

<pre class="src src-bash">$ vi .config
  CONFIG_LOCALVERSION="-lab3"   # change -lab3 string to whatever you'd like
$ make menuconfig       # just choose Exit with the arrow keys
</pre>
</div>



<ol class="org-ol">
<li>Changing the size of physical memory used by linux (and of course
</li>
</ol>
<p>
you cannot make it bigger than what is there).
</p>
<div class="org-src-container">

<pre class="src src-bash"># in your virtual machine edit the file /etc/default/grub
$ sudo vi /etc/default/grub

# add the size of physical memory you want to GRUB_CMD_LINE_LINUX:
GRUB_CMDLINE_LINUX="mem=512m"

# run update-grub and reboot cat out /proc/meminfo to see the change
sudo update-grub
sudo sync
sudo sync
sudo reboot
</pre>
</div>


<ol class="org-ol">
<li>What was the old (initrd) way of building the kernel packages (used 
</li>
</ol>
<p>
in lab2)?
</p>
<div class="org-src-container">

<pre class="src src-bash">fakeroot make-kpkg --initrd --revision=1.0 --append-to-version -lab2  kernel_image
fakeroot make-kpkg --initrd --revision=1.0 --append-to-version -lab2  kernel_headers
</pre>
</div>
</div>
</div>
